{
	"steps": {
		"step-0": {
			"substep_number":"0",
			"type":"no-step-bar",
			"description":"\r\n<p>Energy balance is the balance of kilojoules we eat and drink with the kilojoules we burn through physical activity. A great place to start your journey towards energy balance is to make sure you’re meeting the Australian Guide to Healthy Eating and getting your recommended physical activity each day.<\/p>\r\n"		},
		"step-1": {
			"substep_number":"1",
			"step_number":"1",
			"type":"step-bar",
			"title":"Step 1 - About you",
			"description":"\r\n",
			"slider": ["12-18","19-50","51-70","71+"],
			"sliderInitialValue":"2"
		},
		"step-2": {
			"substep_number":"2",
			"step_number":"2",
			"type":"step-bar",
			"title":"Step 2 - Food Intake",
			"description":"\r\n<p>Drag the icons from the different food groups onto your plate to reflect how many serves of each you eat on a typical day. Don’t forget to think about foods that may be ingredients in dishes or meals you eat. For example, if your lasagna recipe had pasta, meat, cheese and zucchini, make sure you add the portions to each food group.<\/p>\r\n",
			"meal": [
				{
					"name":"fruit",
					"short":"apple",
					"icons":["apple","cherry","strawberry"],
					"content":"A serve of fruit is:<ul><li>1 medium-sized fresh fruit (e.g. a whole apple, banana, or pear)<\/li><li>2 small-sized  fresh fruits (e.g. apricots, kiwis or plums)<\/li><li>1 cup of chopped or canned fruit<\/li><li>½ cup of no added sugar fruit juice<\/li><\/ul>",
					"link":"http://www.eatforhealth.gov.au/food-essentials/five-food-groups/fruit"
				},{
					"name":"vegetables",
					"short":"carrot",
					"icons":["carrot","tomato","peas"],
					"content":"\r\n<p>A serve of vegetables is approximately 75g, for example:<\/p>\r\n<ul>\r\n\t<li>½ cup of raw or cooked vegetables<\/li>\r\n\t<li>½ cup of cooked or canned dried beans, peas or lentils<\/li>\r\n\t<li>1 cup of salad vegetables<\/li>\r\n\t<li>1 medium tomato or carrot<\/li>\r\n\t<li>1 small or ½ a medium potato<\/li>\r\n<\/ul>\r\n",
					"link":"http://www.eatforhealth.gov.au/food-essentials/five-food-groups/vegetables-and-legumes-beans"
				},{			
					"name":"lean meats +*alternatives",
					"short":"meat",
					"content":"Serving examples include:<ul><li>65g of cooked lean meats<\/li><li>½ cup of cooked lean mince<\/li><li>80g of cooked poultry like chicken<\/li><li>100g of cooked fish fillet or a small can of fish<\/li><li>2 large eggs<\/li><li>1 cup cooked dried beans, lentils, chick peas, split peas or canned beans<\/li><li>1 cup  tofu<\/li><li>30g (a small handful) of unsalted nuts<\/li><\/ul>",
					"link":"http://www.eatforhealth.gov.au/food-essentials/five-food-groups/lean-meat-and-poultry-fish-eggs-tofu-nuts-and-seeds-and"
				},{			
					"name":"milk, yoghurt,*cheese",
					"short":"milk",
					"icons":["milk","cheese"],
					"content":"This includes products made from cow’s milk, soy, cereal or nut milk. A serve of milk, yoghurt or cheese is:<ul><li>2 slices of reduced-fat hard cheese<\/li><li>½ cup ricotta cheese<\/li><li>a small tub of reduced fat yoghurt<\/li><li>1 cup of milk or 1 cup of soy milk<\/li><\/ul>",
					"link":"http://www.eatforhealth.gov.au/food-essentials/five-food-groups/milk-yoghurt-cheese-andor-their-alternatives-mostly-reduced-fat"
				},{			
					"name":"grains, cereals",
					"short":"cereals",
					"content":"Serving examples include:<ul><li>1 slice of bread<\/li><li>½ roll or flatbread<\/li><li>½ cup of cooked rice, pasta or noodles<\/li><li>½ cup cooked porridge<\/li><li>⅔ cup wheat cereal flakes<\/li><li>¼ cup muesli<\/li><\/ul>",
					"link":"http://www.eatforhealth.gov.au/food-essentials/five-food-groups/grain-cereal-foods-mostly-wholegrain-and-or-high-cereal-fibre"
				},{
					"name":"discretionary*foods",
					"short":"discret",
					"content": "Discretionary food and drinks are those that contain saturated fat, added salt, added sugars and alcohol. Many of these foods are high in energy, and how many of these foods can fit into your diet while maintaining energy balance will depend on how tall and\/or how active you are. Enjoy  these foods sometimes, and in small amounts.",
					"link":"http://www.eatforhealth.gov.au/food-essentials/discretionary-food-and-drink-choices"
				}
			]
		},
		"step-3": {
			"substep_number":"3",
			"step_number":"2",
			"type":"no-step-bar",
			"title":"Fats, oils and spreads intake",
			"description": "What fats, oils, and spreads do you use on a regular basis?<br \/>Select the ones below that you use.<br \/>When you’re done, click ‘Next’.",
			"oils":["Olive Oil","Canola oil","vegetable oil","butter","margarine","dairy blend"]
		},
		"step-4": {
			"substep_number":"4",
			"step_number":"2",
			"type":"no-step-bar",
			"title":"Glasses of water",
			"description": "How many glasses of water do you drink each day? Add the number of glasses you drink on a typical day. When you’re done, click ‘Next’."		},
		"step-5": {
			"substep_number":"5",
			"step_number":"3",
			"type":"step-bar",
			"title":"Step 3 - Activity",
			"description":"\r\n<p>You’ve given us an idea of what you’re eating and drinking patterns look like - now tell us about your physical activity levels! Select the number of hours you spend doing low, medium, or high intensity exercise in a <em><span style=\"text-decoration: underline;\"><strong>typical week<\/strong><\/span><\/em>. This includes organised sport or gym sessions, but also incidental exercise like working in the house or garden, or walking to school or work.<\/p>\r\n",
			"activities":[
				{
					"title":"Moderate",
					"icon":"bicycle",
					"init":"0",
					"examples":["Biking","Swimming", "Brisk walking"],
					"description":"Moderate-intensity activity will cause a slight, but noticeable, increase in your breathing and heart rate. A good guide is an activity where you are able to comfortably talk but not sing. Examples include a brisk walk, mowing the lawn, digging in the garden, or medium paced swimming or cycling."				},
				{
					"title":"High",
					"icon":"lifting",
					"init":"0",
					"examples":["Gym class","Running", "Competitive sports"],
					"description":"High intensity activities will make you huff and puff! These include vigorous activities like football, netball, soccer, running, aerobics, fast paced cycling or training for sport."				}
			]
		}
	},
	"results":{
		"food":{
			"foods":["fruit","vegetables","lean_meats","milk","cereals","discretionary"],
			"general":{
				"satisfactory":"\r\n<p>By comparing the two plates above, you can see that you are doing a great job of meeting the recommended food groups. Remember to enjoy a wide variety of nutritious foods from these food groups every day.<\/p>\r\n",
				"increase":"\r\n<p>By comparing the two plates above, you can see that you might benefit from some small changes to your eating pattern. To help achieve and maintain energy balance, it is important to enjoy a wide variety of nutritious foods from these food groups every day.<\/p>\r\n"			},
			"fruit":{
				"increase":["Increase your fruit intake by keeping your fruit bowl full, so you can grab an apple or an orange on your way out the door.", "Choose fruits that are in season – they will be tastier, and more appealing for you to eat.", "Increase your fruit intake by whipping up a fruit salad for a healthy dessert – you can even have the recommended servings in one go this way."],
				"decrease":["You’re getting plenty of fruit each day! The key to healthy eating is balance, so make sure you’re not neglecting foods from the other food groups."]
			},
			"vegetables":{
				"increase":["Include more vegetables into your favourite meals – try eggplant in spaghetti bolognaise, or pumpkin in your lasagne.", "Prepare veggie snacks for yourself and your family the day before work or school. Carrot and celery sticks are a favourite – especially with some low fat dip.", "Soups and salads as an entrée are a great way of increasing your vegetable intake and ensuring you fill up on the good stuff!"],
				"decrease":["You’re getting plenty of vegetables each day! The key to healthy eating is balance, so make sure you’re not neglecting foods from the other food groups."]
			},
			"lean_meats":{
				"increase":["Eggs are a great source of protein. Whip up an omelette, frittata, or classic scrambled eggs on toast for breakfast, lunch or dinner!", "Legumes are so nutritious and a good source of protein. Why not toss some chickpeas into your salad?"],
				"decrease":["You’re getting plenty of serves of meat or alternatives each day! The key to healthy eating is balance, so make sure you’re not neglecting foods from the other food groups."]
			},
			"milk":{
				"increase":["Kick off your day with dairy. Have cereal with low fat or reduced fat milk, or fresh fruit topped with low-fat plain or fruit yogurt.", "Top your favourite dinner recipes with a small portion of grated cheese – pasta dishes, salads and even soups.", "Increase your dairy intake by having a glass of reduced fat milk or a glass of reduced fat flavoured milk."],
				"decrease":["You’re getting plenty of dairy each day! The key to healthy eating is balance, so make sure you’re not neglecting foods from the other food groups."]
			},
			"cereals":{
				"increase":["Rice is a very versatile ingredient. Look for low GI, as well as brown and wild rice varieties for a fibre boost!", "Fixing yourself some toast or a sandwich? Reach for a wholegrain or wholemeal bread instead of white to boost the fibre content in your diet."],
				"decrease":["You’re getting plenty of grains and cereals each day! The key to healthy eating is balance, so make sure you’re not neglecting foods from the other food groups."]
			},
			"discretionary":{
				"increase":["Be sincere with yourself. Sometimes you just need a cookie!!"],
				"decrease":["Many Australians would benefit from eating smaller amounts of discretionary foods. These foods are high in saturated fats, added salt or added sugars, and are best eaten only sometimes and in small amounts."]
			}
		},
		"activity":{
			"general":{
				"satisfactory":"\r\n<p>Most Australians are recommended 30 minutes of moderate activity each day, or 60 minutes if you are under 18 years of age. You're doing a great job in meeting this recommendation. Remember, different physical activities will stretch and strengthen different muscles, increase your coordination skills and balance, and add to your overall fitness.<\/p>\r\n",
				"increase":"\r\n<p>Most Australians are recommended to include 30 minutes of moderate activity into their day, or 60 minutes if you are under 18 years of age. You have a little way to go to reach this goal. Remember, your 30 minutes can be accumulated by combining short bouts of around 10 to 15 minutes each.<\/p>\r\n",
				"pregnant":"\r\n<p>If you are pregnant, speak with your doctor about what physical activities are recommended for you and your baby. Regular exercise should be low impact options such as walking, swimming, yoga or pilates.<\/p>\r\n"			},
			"age-12-18":{
				"increase":["Try to introduce moderate activity to every day, like walking the dog, bike riding, skateboarding, and dancing.", "Try to do 20 minutes of higher intensity activity 3–4 days a week. That means exercise that really gets your heart pumping. Try training for a sport like soccer or netball, running or swimming laps."],
				"satisfactory":["Try adding some variety to your regular exercise regime. This can be a new team sport, or one-off sporting adventures like horse rising, rock climbing or ice skating."]
			},
			"age-19-50":{
				"increase":["Try to introduce moderate activity into your day - something that will increase your breathing and heart rate. This can be brisk walking, or medium paced swimming or cycling. Even mowing the lawn, gardening or house cleaning can do the trick.", "Try to include in your week some vigorous exercise for extra health and fitness. Why not take up jogging, skipping, or higher intensity swimming or cycling?", "If you are recommencing physical activity, or are starting a new physical activity, make sure you start at a level that is easily manageable and gradually build up the recommended amount, type and frequency of activity."],
				"satisfactory":["To build on your current exercise routine, try a new team sport or gym class, or one-off sporting adventures like a hike, a marathon, or a kayaking trip.", "Try to incorporate more exercise into your daily schedule, like walking or bike riding to the train station instead of driving, hopping off the bus one stop early, or parking your car further away to walk the rest of the way.", "If you are increasing your intensity or starting a new physical activity, make sure you start at a level that is easily manageable, and gradually build up the recommended amount, type and frequency of activity."]
			},
			"age-51-70":{
				"increase":["Try to introduce moderate activity into your day - something that will increase your breathing and heart rate. This can be walking, or even gardening or house cleaning.", "Try to undertake a higher intensity activity occasionally, for example tennis, power walking, or chasing after the grandchildren.", "If you are recommencing physical activity, or are starting a new physical activity, make sure you start at a level that is easily manageable and gradually build up the recommended amount, type and frequency of activity."],
				"satisfactory":["Try a new regular exercise commitment like yoga, pilates or a gym class, or one-off sporting adventures like a bush walk, a bike ride, or low impact aerobics.", "Try to incorporate more exercise into your daily schedule, like walking or bike riding to the train station instead of driving, hopping off the bus one stop early, or parking your car further away to walk the rest of the way.", "If you are increasing your intensity or starting a new physical activity, make sure you start at a level that is easily manageable, and gradually build up the recommended amount, type and frequency of activity."]
			},
			"age-71+":{
				"increase":["Try to introduce moderate activity into your day - something that will increase your breathing and heart rate. This can be walking, or even gardening or house cleaning. 1", "Try to undertake a higher intensity activity occasionally, for example tennis, power walking, or chasing after the grandchildren. 2", "If you are recommencing physical activity, or are starting a new physical activity, make sure you start at a level that is easily manageable and gradually build up the recommended amount, type and frequency of activity. 3"],
				"satisfactory":["Why not try a new regular exercise commitment like aqua aerobics, tai chi, bowls, a low impact gym class, or one-off sporting adventures like a bush walk?", "If you are increasing your intensity or starting a new physical activity, make sure you start at a level that is easily manageable, and gradually build up the recommended amount, type and frequency of activity."]
			}
		}
	},
	"recommendations":{
		"male":{
			"age-12-18":{
				"fruit":[2,4],
				"fruit-r":2,
				"vegetables":[5,7],
				"vegetables-r":5.5,
				"lean_meats":[2,3],
				"lean_meats-r":2.5,
				"milk":[3,4],
				"milk-r":3.5,
				"cereals":[6,7],
				"cereals-r":7,
				"discretionary":0,
				"activity":420
			},
			"age-19-50":{
				"fruit":[2,4],
				"fruit-r":2,
				"vegetables":[5,7],
				"vegetables-r":6,
				"lean_meats":[2,3],
				"lean_meats-r":3,
				"milk":[2,3],
				"milk-r":2.5,
				"cereals":[6,7],
				"cereals-r":6,
				"discretionary":0,
				"activity":210
			},
			"age-51-70":{
				"fruit":[2,4],
				"fruit-r":2,
				"vegetables":[5,7],
				"vegetables-r":5.5,
				"lean_meats":[2,3],
				"lean_meats-r":2.5,
				"milk":[2,3],
				"milk-r":2.5,
				"cereals":[6,7],
				"cereals-r":6,
				"discretionary":0,
				"activity":210
			},
			"age-71+":{
				"fruit":[2,4],
				"fruit-r":2,
				"vegetables":[5,7],
				"vegetables-r":5,
				"lean_meats":[2,3],
				"lean_meats-r":2.5,
				"milk":[3,4],
				"milk-r":3.5,
				"cereals":[3,5],
				"cereals-r":4.5,
				"discretionary":0,
				"activity":210
			}
		},
		"female":{
			"age-12-18":{
				"fruit":[2,4],
				"fruit-r":2,
				"vegetables":[5,7],
				"vegetables-r":5,
				"lean_meats":[2,3],
				"lean_meats-r":2.5,
				"milk":[3,4],
				"milk-r":3.5,
				"cereals":[6,7],
				"cereals-r":7,
				"discretionary":0,
				"activity":420
			},
			"age-19-50":{
				"fruit":[2,4],
				"fruit-r":2,
				"vegetables":[5,7],
				"vegetables-r":5,
				"lean_meats":[2,3],
				"lean_meats-r":2.5,
				"milk":[2,3],
				"milk-r":2.5,
				"cereals":[6,7],
				"cereals-r":6,
				"discretionary":0,
				"activity":210
			},
			"age-51-70":{
				"fruit":[2,4],
				"fruit-r":2,
				"vegetables":[5,7],
				"vegetables-r":5,
				"lean_meats":[2,3],
				"lean_meats-r":2,
				"milk":4,
				"cereals":[3,5],
				"cereals-r":4,
				"discretionary":0,
				"activity":210
			},
			"age-71+":{
				"fruit":[2,4],
				"fruit-r":2,
				"vegetables":[5,7],
				"vegetables-r":5,
				"lean_meats":[2,3],
				"lean_meats-r":2,
				"milk":4,
				"cereals":[3,5],
				"cereals-r":3,
				"discretionary":0,
				"activity":210
			}
		},	
		"pregnant":{
			"fruit":[2,4],
			"fruit-r":2,
			"vegetables":[5,7],
			"vegetables-r":5,
			"lean_meats":[3,4],
			"lean_meats-r":3.5,
			"milk":[2,3],
			"milk-r":2.5,
			"cereals":[8,9],
			"cereals-r":8.5,
			"discretionary":0,
			"activity":"Special copy for pregnant Women."
		},
		"breastfeeding":{
			"fruit":[2,4],
			"fruit-r":2,
			"vegetables":[5,7],
			"vegetables-r":7.5,
			"lean_meats":[2,3],
			"lean_meats-r":2.5,
			"milk":[2,3],
			"milk-r":2.5,
			"cereals":[8,9],
			"cereals-r":9,
			"discretionary":0
		}
	}
}